---
type: ElementClassFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementClassFilter

`Autodesk.Revit.DB.ElementClassFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementClassFilter | — | `` |
| Method | GetElementClass | 2011 | `public Type GetElementClass ()` |
| Method | PassesFilter | — | `` |